STMicroelectronics/STM32CubeG0/Drivers/BSP/STM32G0C1E-EV/stm32g0c1e_eval_mux.c
/**
  ******************************************************************************
  * @file    stm32g0c1e_eval_mux.c
  * @author  MCD Application Team
  * @brief   This file provides a set of functions needed to manage the Type-C
  *          MUX associated to a Type-C receptacle. These functions allow for
  *          reconfiguring the pins of the Type-C receptacle when the related
  *          Type-C port operate in DisplayPort alternate mode or
  *          when it is used as a USB 3.1 to USB Type-C adapter.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2020 STMicroelectronics</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include <stdio.h>
#include "stm32g0c1e_eval.h"
#include "stm32g0c1e_eval_mux.h"
#include "stm32g0xx_hal.h"

/** @addtogroup BSP
  * @{
  */

/** @addtogroup STM32G0C1E_EVAL
  * @{
  */

/** @addtogroup STM32G0C1E_EVAL_MUX
  * @{
  */

/** @defgroup STM32G0C1E_EVAL_MUX_Private_Typedef Private Typedef
  * @{
  */
typedef enum {
    MUX_NOT_INITIALIZED = 0,
    MUX_INITIALIZED
} MUX_StateTypedef;

typedef struct {
    MUX_StateTypedef    State;
    TYPECSWITCH_Drv_t * TypeCSwitch_Drv;
    uint16_t            I2C_Address_TypeCSwitch;
    DPREDRIVER_Drv_t  * DPRedriver_Drv;
    uint16_t            I2C_Address_DPRedriver;
} MuxInfoTypeDef;

typedef struct {
#if defined(TUSB546_DEBUG)
    TUSB546_RegistersTypeDef            TUSB546_Registers;
#endif /* TUSB546_DEBUG */
#if defined(CBTL08GP053_DEBUG)
    CBTL08GP053_RegistersTypeDef        CBTL08GP053_Registers;
#endif /* CBTL08GP053_DEBUG */
#if defined(SN65DP141_DEBUG)
    SN65DP141_RegistersTypeDef          SN65DP141_Registers;
#endif /* CBTL08GP053_DEBUG */
    MUX_HPDCallbackFuncTypeDef *        pfnHPDCallbackFunc;
    MUX_HPDStateTypeDef                 HPDState;
    MuxInfoTypeDef                      MuxInfo[TYPE_C_MUX_NB];
} ContextTypeDef;

typedef enum
{
    DET_HPD_SOURCE = 0
} DetectId_TypeDef;

typedef enum
{
    SEL_HPDIN      = 0
} SelectId_TypeDef;

typedef enum {
    DET_STATE_LOW = 0,
    DET_STATE_HIGH
} MUX_DETState_TypeDef;

/**
  * @}
  */

/** @defgroup STM32G0C1E_EVAL_MUX_Private_Macros Private Macros
  * @{
  */
#define DETx_GPIO_CLK_ENABLE(__DET__)    do { if((__DET__) == DET_HPD_SOURCE) DET_HPD_SOURCE_GPIO_CLK_ENABLE();} while(0)

#define SELx_GPIO_CLK_ENABLE(__SEL__)    do { if((__SEL__) == SEL_HPDIN)     SEL_HPDIN_GPIO_CLK_ENABLE();} while(0)
/**
  * @}
  */

/** @defgroup STM32G0C1E_EVAL_MUX_Private_Variables Private Variables
  * @{
  */
static const TYPECSWITCH_Mode_t ModeSelect[2][13] =
{
    /* PLUG_ORIENTATION_NORMAL */
    {
        DFP_D_PIN_ASSIGNMENT_A_NORMAL,  /* DFP_PIN_ASSIGNMMENT_A    */
        DFP_D_PIN_ASSIGNMENT_B_NORMAL,  /* DFP_PIN_ASSIGNMMENT_B    */
        DFP_D_PIN_ASSIGNMENT_C_NORMAL,  /* DFP_PIN_ASSIGNMMENT_C    */
        DFP_D_PIN_ASSIGNMENT_D_NORMAL,  /* DFP_PIN_ASSIGNMMENT_D    */
        DFP_D_PIN_ASSIGNMENT_E_NORMAL,  /* DFP_PIN_ASSIGNMMENT_E    */
        DFP_D_PIN_ASSIGNMENT_F_NORMAL,  /* DFP_PIN_ASSIGNMMENT_F    */
        UFP_D_PIN_ASSIGNMENT_A_NORMAL,  /* UFP_PIN_ASSIGNMMENT_A    */
        UFP_D_PIN_ASSIGNMENT_B_NORMAL,  /* UFP_PIN_ASSIGNMMENT_B    */
        UFP_D_PIN_ASSIGNMENT_C_NORMAL,  /* UFP_PIN_ASSIGNMMENT_C    */
        UFP_D_PIN_ASSIGNMENT_D_NORMAL,  /* UFP_PIN_ASSIGNMMENT_D    */
        UFP_D_PIN_ASSIGNMENT_E_NORMAL,  /* UFP_PIN_ASSIGNMMENT_E    */
        UFP_D_PIN_ASSIGNMENT_F_NORMAL,  /* UFP_PIN_ASSIGNMMENT_F    */
        USB_NORMAL                      /* USB_ONLY_PIN_ASSIGNMMENT */
    },

    /* PLUG_ORIENTATION_FLIPPED */
    {

        DFP_D_PIN_ASSIGNMENT_A_FLIPPED,  /* DFP_PIN_ASSIGNMMENT_A    */
        DFP_D_PIN_ASSIGNMENT_B_FLIPPED,  /* DFP_PIN_ASSIGNMMENT_B    */
        DFP_D_PIN_ASSIGNMENT_C_FLIPPED,  /* DFP_PIN_ASSIGNMMENT_C    */
        DFP_D_PIN_ASSIGNMENT_D_FLIPPED,  /* DFP_PIN_ASSIGNMMENT_D    */
        DFP_D_PIN_ASSIGNMENT_E_FLIPPED,  /* DFP_PIN_ASSIGNMMENT_E    */
        DFP_D_PIN_ASSIGNMENT_F_FLIPPED,  /* DFP_PIN_ASSIGNMMENT_F    */
        UFP_D_PIN_ASSIGNMENT_A_FLIPPED,  /* UFP_PIN_ASSIGNMMENT_A    */
        UFP_D_PIN_ASSIGNMENT_B_FLIPPED,  /* UFP_PIN_ASSIGNMMENT_B    */
        UFP_D_PIN_ASSIGNMENT_C_FLIPPED,  /* UFP_PIN_ASSIGNMMENT_C    */
        UFP_D_PIN_ASSIGNMENT_D_FLIPPED,  /* UFP_PIN_ASSIGNMMENT_D    */
        UFP_D_PIN_ASSIGNMENT_E_FLIPPED,  /* UFP_PIN_ASSIGNMMENT_E    */
        UFP_D_PIN_ASSIGNMENT_F_FLIPPED,  /* UFP_PIN_ASSIGNMMENT_F    */
        USB_FLIPPED                      /* USB_ONLY_PIN_ASSIGNMMENT */
    }
};

/**
* @brief SEL variables
*/
static GPIO_TypeDef* SEL_PORT[SELn] = {
    SEL_HPDIN_GPIO_PORT,
};

static uint16_t SEL_PIN[SELn] = {
    SEL_HPDIN_PIN,
};

/* BSP PWR contextual data */
static ContextTypeDef Context =
{
    .HPDState              = HPD_STATE_LOW,
    .pfnHPDCallbackFunc    = (MUX_HPDCallbackFuncTypeDef *)NULL,
    .MuxInfo =
    {
        /* TYPE_C_MUX_1 */
        {
            .State                   = MUX_NOT_INITIALIZED,
            .TypeCSwitch_Drv         = &tusb546_drv_CrossSwitch,
            .I2C_Address_TypeCSwitch = MUX_1_TYPEC_SWITCH_I2C_ADDRESS,
            .DPRedriver_Drv          = &tusb546_drv_LinearRedriver,
            .I2C_Address_DPRedriver  = MUX_1_DP_REDRIVER_I2C_ADDRESS
        },
        /* TYPE_C_MUX_2 */
        {
            .State                   = MUX_NOT_INITIALIZED,
            .TypeCSwitch_Drv         = &cbtl08gp053_drv,
            .I2C_Address_TypeCSwitch = MUX_2_TYPEC_SWITCH_I2C_ADDRESS,
            .DPRedriver_Drv          = &sn65dp141_drv,
            .I2C_Address_DPRedriver  = MUX_2_DP_REDRIVER_I2C_ADDRESS
        }
    }
};

/**
  * @}
  */

/** @defgroup STM32G0C1E_EVAL_MUX_Private_Functions Private Functions
  * @{
  */
static void MUX_DET_Init(void);
static void MUX_DET_DeInit(void);
static MUX_DETState_TypeDef MUX_DET_GetState(void);
static void MUX_SEL_Init(SelectId_TypeDef Sel);
static void MUX_SEL_DeInit(SelectId_TypeDef Sel);
static void MUX_SEL_On(SelectId_TypeDef Sel);
static void MUX_SEL_Off(SelectId_TypeDef Sel);
static void MUX_DebounceTimerSetConfig(uint32_t DebounceTime);
static void MUX_DebounceTimerResetConfig(void);
/**
  * @}
  */

/** @defgroup STM32G0C1E_EVAL_MUX_Exported_Variables Exported Variables
  * @{
  */
TIM_HandleTypeDef htim = {.Instance = DEBOUNCE_TIM_INSTANCE};
/**
  * @}
  */

