STMicroelectronics/STM32CubeG0/Drivers/BSP/STM32G0C1E-EV/stm32g0c1e_eval_mux.c
/** @addtogroup STM32G0C1E_EVAL_MUX_Exported_Functions
  * @{
  */

/**
 * @brief  Initialize the hardware resources used by the Type-C MUX
 *         assigned to a given Type-C MUX.
 * @param  TypeCMuxId Type-C MUX identifier
 *         This parameter can be take one of the following values:
 *         @arg TYPE_C_MUX_1
 *         @arg TYPE_C_MUX_2
 * @retval mux status
 */
MUX_StatusTypeDef BSP_MUX_Init(MUX_TypeCMuxIdTypeDef TypeCMuxId)
{
    uint32_t ret = 0;

    if (Context.MuxInfo[TypeCMuxId].State == MUX_NOT_INITIALIZED)
    {
        switch (TypeCMuxId)
        {
        case TYPE_C_MUX_1:
        case TYPE_C_MUX_2:
            /* USB Type-C Crossbar Switch initialization */
            ret += Context.MuxInfo[TypeCMuxId].TypeCSwitch_Drv->Init(Context.MuxInfo[TypeCMuxId].I2C_Address_TypeCSwitch);

            /* DisplayPort Linear Redriver initialization */
            ret += Context.MuxInfo[TypeCMuxId].DPRedriver_Drv->Init(Context.MuxInfo[TypeCMuxId].I2C_Address_DPRedriver);

            if (TypeCMuxId == TYPE_C_MUX_1)
            {
                MUX_SEL_Init(SEL_HPDIN);
            }
            else
            {
                /* DET_HPD_SOURCE */
                MUX_DET_Init();
            }

            /* Initialize the debounce timer (if not done already) */
            if ((Context.MuxInfo[TYPE_C_MUX_1].State == MUX_NOT_INITIALIZED) &&
                    (Context.MuxInfo[TYPE_C_MUX_2].State == MUX_NOT_INITIALIZED))
            {
                MUX_DebounceTimerSetConfig(DEBOUNCE_TIME);
            }

            /* Update Context */
            Context.MuxInfo[TypeCMuxId].State = MUX_INITIALIZED;

            break;

        default:
            ret++;
            break;
        }
    }

    return (ret == 0) ? MUX_OK : MUX_ERROR;
}

/**
 * @brief  Free the hardware resources used by the Type-C MUX
 *         assigned to a given Type-C MUX.
 * @param  TypeCMuxId Type-C MUX identifier
 *         This parameter can be take one of the following values:
 *         @arg TYPE_C_MUX_1
 *         @arg TYPE_C_MUX_2
 * @retval mux status
 */
MUX_StatusTypeDef BSP_MUX_DeInit(MUX_TypeCMuxIdTypeDef TypeCMuxId)
{
    uint32_t ret = 0;

    if (Context.MuxInfo[TypeCMuxId].State == MUX_INITIALIZED)
    {
        switch (TypeCMuxId)
        {
        case TYPE_C_MUX_1:
        case TYPE_C_MUX_2:
            /* USB Type-C Crossbar Switch de-initialization */
            Context.MuxInfo[TypeCMuxId].TypeCSwitch_Drv->DeInit(Context.MuxInfo[TypeCMuxId].I2C_Address_TypeCSwitch);

            /* DisplayPort Linear Redriver de-initialization */
            Context.MuxInfo[TypeCMuxId].DPRedriver_Drv->DeInit(Context.MuxInfo[TypeCMuxId].I2C_Address_DPRedriver);

            if (TypeCMuxId == TYPE_C_MUX_1)
            {
                MUX_DebounceTimerResetConfig();
                MUX_SEL_DeInit(SEL_HPDIN);
            }
            else
            {
                /* DET_HPD_SOURCE */
                MUX_DET_DeInit();
            }

            /* Update Context */
            Context.MuxInfo[TypeCMuxId].State = MUX_NOT_INITIALIZED;

            /* De-initialize the debounce timer (if not required anymore)*/
            if ((Context.MuxInfo[TYPE_C_MUX_1].State == MUX_NOT_INITIALIZED) &&
                    (Context.MuxInfo[TYPE_C_MUX_2].State == MUX_NOT_INITIALIZED))
            {
                MUX_DebounceTimerResetConfig();
            }

            break;

        default:
            ret++;
            break;
        }
    }

    return (ret == 0) ? MUX_OK : MUX_ERROR;
}

/**
 * @brief  Power on the Type-C MUX.
 * @param  TypeCMuxId Type-C MUX identifier
 *         This parameter can be take one of the following values:
 *         @arg TYPE_C_MUX_1
 *         @arg TYPE_C_MUX_2
 * @retval mux status
 */
MUX_StatusTypeDef BSP_MUX_Enable(MUX_TypeCMuxIdTypeDef TypeCMuxId)
{
    uint32_t ret = 0;

    switch (TypeCMuxId)
    {
    case TYPE_C_MUX_1:
    case TYPE_C_MUX_2:
        /* Power on USB Type-C Crossbar Switch */
        ret += Context.MuxInfo[TypeCMuxId].TypeCSwitch_Drv->PowerOn(Context.MuxInfo[TypeCMuxId].I2C_Address_TypeCSwitch);

        /* Power on  DisplayPort Linear Redriver */
        ret += Context.MuxInfo[TypeCMuxId].DPRedriver_Drv->PowerOn(Context.MuxInfo[TypeCMuxId].I2C_Address_DPRedriver);

        break;

    default:
        ret++;
        break;
    }

    return (ret == 0) ? MUX_OK : MUX_ERROR;
}
/**
 * @brief  Power down the Type-C MUX.
 * @param  TypeCMuxId Type-C MUX identifier
 *         This parameter can be take one of the following values:
 *         @arg TYPE_C_MUX_1
 *         @arg TYPE_C_MUX_2
 * @retval mux status
 */
MUX_StatusTypeDef BSP_MUX_Disable(MUX_TypeCMuxIdTypeDef TypeCMuxId)
{
    uint32_t ret = 0;

    switch (TypeCMuxId)
    {
    case TYPE_C_MUX_1:
    case TYPE_C_MUX_2:
        /* Power off USB Type-C Crossbar Switch */
        ret += Context.MuxInfo[TypeCMuxId].TypeCSwitch_Drv->PowerOff(Context.MuxInfo[TypeCMuxId].I2C_Address_TypeCSwitch);

        /* Power down DisplayPort Linear Redriver */
        ret += Context.MuxInfo[TypeCMuxId].DPRedriver_Drv->PowerOff(Context.MuxInfo[TypeCMuxId].I2C_Address_DPRedriver);

        break;

    default:
        ret++;
        break;
    }

    return (ret == 0) ? MUX_OK : MUX_ERROR;
}

/**
 * @brief  Set the pin assignment of the USB Type-C connector when it operates
 *         in one of the following mode:
 *         DFP_D: Downstream Facing Port associated with a DisplayPort Source device
 *         UFP_D: Upstream Facing Port associated with a DisplayPort Source device
 * @param  TypeCMuxId Type-C MUX identifier
 *         This parameter can be take one of the following values:
 *         @arg TYPE_C_MUX_1
 *         @arg TYPE_C_MUX_2
 * @param  TypeCPlugOrientation Type-C plug orientation
 *         This parameter can be take one of the following values:
 *         @arg PLUG_ORIENTATION_NORMAL
 *         @arg PLUG_ORIENTATION_FLIPPED
 * @param  TypeCConnectorPinAssignment Type-C connector pin assignment
 *         This parameter can be take one of the following values:
 *         @arg DFP_PIN_ASSIGNMMENT_A
 *         @arg DFP_PIN_ASSIGNMMENT_B
 *         @arg DFP_PIN_ASSIGNMMENT_C
 *         @arg DFP_PIN_ASSIGNMMENT_D
 *         @arg DFP_PIN_ASSIGNMMENT_E
 *         @arg DFP_PIN_ASSIGNMMENT_F
 *         @arg UFP_PIN_ASSIGNMMENT_A
 *         @arg UFP_PIN_ASSIGNMMENT_B
 *         @arg UFP_PIN_ASSIGNMMENT_C
 *         @arg UFP_PIN_ASSIGNMMENT_D
 *         @arg UFP_PIN_ASSIGNMMENT_E
 *         @arg UFP_PIN_ASSIGNMMENT_F
 *         @arg USB_ONLY_PIN_ASSIGNMMENT
 * @retval mux status
 */
MUX_StatusTypeDef BSP_MUX_SetDPPinAssignment(MUX_TypeCMuxIdTypeDef                  TypeCMuxId,
        MUX_TypeCPlugOrientationTypeDef        TypeCPlugOrientation,
        MUX_TypeCConnectorPinAssignmentTypeDef TypeCConnectorPinAssignment)
{
    uint32_t ret = 0;
    TYPECSWITCH_Mode_t Mode;

    Mode = ModeSelect[TypeCPlugOrientation][TypeCConnectorPinAssignment];

    if (Context.MuxInfo[TypeCMuxId].TypeCSwitch_Drv->IsSupportedMode(Mode))
    {
        /* Set Alt. mode */
        ret += Context.MuxInfo[TypeCMuxId].TypeCSwitch_Drv->SetMode(Context.MuxInfo[TypeCMuxId].I2C_Address_TypeCSwitch, Mode);

        /* Enable Display Port channels (if required) */
        switch(TypeCConnectorPinAssignment)
        {
        case USB_ONLY_PIN_ASSIGNMMENT:
            /* no DP channel enabled */
            ret += Context.MuxInfo[TypeCMuxId].DPRedriver_Drv->DisableChannel(Context.MuxInfo[TypeCMuxId].I2C_Address_DPRedriver, CHANNEL_DP0);
            ret += Context.MuxInfo[TypeCMuxId].DPRedriver_Drv->DisableChannel(Context.MuxInfo[TypeCMuxId].I2C_Address_DPRedriver, CHANNEL_DP1);
            ret += Context.MuxInfo[TypeCMuxId].DPRedriver_Drv->DisableChannel(Context.MuxInfo[TypeCMuxId].I2C_Address_DPRedriver, CHANNEL_DP2);
            ret += Context.MuxInfo[TypeCMuxId].DPRedriver_Drv->DisableChannel(Context.MuxInfo[TypeCMuxId].I2C_Address_DPRedriver, CHANNEL_DP3);
            break;
        case DFP_PIN_ASSIGNMMENT_B:
        case DFP_PIN_ASSIGNMMENT_D:
        case DFP_PIN_ASSIGNMMENT_F:
        case UFP_PIN_ASSIGNMMENT_B:
        case UFP_PIN_ASSIGNMMENT_D:
        case UFP_PIN_ASSIGNMMENT_F:
            /* Enable Display Port ML0 and ML1  */
            ret += Context.MuxInfo[TypeCMuxId].DPRedriver_Drv->EnableChannel(Context.MuxInfo[TypeCMuxId].I2C_Address_DPRedriver, CHANNEL_DP0);
            ret += Context.MuxInfo[TypeCMuxId].DPRedriver_Drv->EnableChannel(Context.MuxInfo[TypeCMuxId].I2C_Address_DPRedriver, CHANNEL_DP1);
            ret += Context.MuxInfo[TypeCMuxId].DPRedriver_Drv->DisableChannel(Context.MuxInfo[TypeCMuxId].I2C_Address_DPRedriver, CHANNEL_DP2);
            ret += Context.MuxInfo[TypeCMuxId].DPRedriver_Drv->DisableChannel(Context.MuxInfo[TypeCMuxId].I2C_Address_DPRedriver, CHANNEL_DP3);
            break;
        case DFP_PIN_ASSIGNMMENT_A:
        case DFP_PIN_ASSIGNMMENT_C:
        case DFP_PIN_ASSIGNMMENT_E:
        case UFP_PIN_ASSIGNMMENT_A:
        case UFP_PIN_ASSIGNMMENT_C:
        case UFP_PIN_ASSIGNMMENT_E:
            /* Enable Display Port ML0, ML1, ML2 and ML3  */
            ret += Context.MuxInfo[TypeCMuxId].DPRedriver_Drv->EnableChannel(Context.MuxInfo[TypeCMuxId].I2C_Address_DPRedriver, CHANNEL_DP0);
            ret += Context.MuxInfo[TypeCMuxId].DPRedriver_Drv->EnableChannel(Context.MuxInfo[TypeCMuxId].I2C_Address_DPRedriver, CHANNEL_DP1);
            ret += Context.MuxInfo[TypeCMuxId].DPRedriver_Drv->EnableChannel(Context.MuxInfo[TypeCMuxId].I2C_Address_DPRedriver, CHANNEL_DP2);
            ret += Context.MuxInfo[TypeCMuxId].DPRedriver_Drv->EnableChannel(Context.MuxInfo[TypeCMuxId].I2C_Address_DPRedriver, CHANNEL_DP3);
            break;
        }
    }

    return (ret == 0) ? MUX_OK : MUX_ERROR;
}

/**
 * @brief  Set the equalizer gain for all the channels
 * @param  TypeCMuxId Type-C MUX identifier
 *         This parameter can be take one of the following values:
 *         @arg TYPE_C_MUX_1
 *         @arg TYPE_C_MUX_2
 * @param  EQGain Equalizer gain.
 *          TYPE_C_MUX_1: This parameter must be a value between 0x00 and @ref MUX_1_EQGAIN_MAX.
 *          TYPE_C_MUX_2: This parameter must be a value between 0x00 and @ref MUX_2_EQGAIN_MAX.
 * @retval mux status
 */
MUX_StatusTypeDef BSP_MUX_SetEQGain(MUX_TypeCMuxIdTypeDef                  TypeCMuxId,
        uint8_t                     EQGain)
{
  uint32_t ret = 1;

  if (((TYPE_C_MUX_1 == TypeCMuxId) && (MUX_1_EQGAIN_MAX >= EQGain))
   || ((TYPE_C_MUX_2 == TypeCMuxId) && (MUX_2_EQGAIN_MAX >= EQGain)))
  {
    ret = 0;
    /* Set EQ gain for Port ML0, ML1, ML2 and ML3  */
    ret += Context.MuxInfo[TypeCMuxId].DPRedriver_Drv->SetEQGain(Context.MuxInfo[TypeCMuxId].I2C_Address_DPRedriver, CHANNEL_DP0, EQGain);
    ret += Context.MuxInfo[TypeCMuxId].DPRedriver_Drv->SetEQGain(Context.MuxInfo[TypeCMuxId].I2C_Address_DPRedriver, CHANNEL_DP1, EQGain);
    ret += Context.MuxInfo[TypeCMuxId].DPRedriver_Drv->SetEQGain(Context.MuxInfo[TypeCMuxId].I2C_Address_DPRedriver, CHANNEL_DP2, EQGain);
    ret += Context.MuxInfo[TypeCMuxId].DPRedriver_Drv->SetEQGain(Context.MuxInfo[TypeCMuxId].I2C_Address_DPRedriver, CHANNEL_DP3, EQGain);
  }

  return (ret == 0) ? MUX_OK : MUX_ERROR;
}

/**
 * @brief  Set the HPD level seen by the DP source device.
 * @note This function is used to enable DisplayPort HPD signaling
 *       through PD messaging.
 * @param  TypeCMuxId Type-C MUX identifier
 *         This parameter can be take one of the following values:
 *         @arg TYPE_C_MUX_1
 *         @arg TYPE_C_MUX_2
 * @param  HPDState Hot Plud Detection (HPD) state
 *         This parameter can be take one of the following values:
 *         @arg HPD_STATE_LOW
 *         @arg HPD_STATE_HIGH
 * @retval mux status
 */
MUX_StatusTypeDef BSP_MUX_SetHPDState(MUX_TypeCMuxIdTypeDef  TypeCMuxId,
                                      MUX_HPDStateTypeDef    HPDState)
{
    uint32_t ret = 0;

    switch (TypeCMuxId)
    {
    case TYPE_C_MUX_1:
        if(HPD_STATE_LOW == HPDState)
        {
            MUX_SEL_Off(SEL_HPDIN);
        }
        else
        {
            MUX_SEL_On(SEL_HPDIN);
        }
        break;

    default:
        ret++;
        break;
    }

    return (ret == 0) ? MUX_OK : MUX_ERROR;
}

/**
 * @brief  Retrieve actual HPD level of the DP source device.
 * @param  TypeCMuxId Type-C MUX identifier
 *         This parameter can be take one of the following values:
 *         @arg TYPE_C_MUX_1
 *         @arg TYPE_C_MUX_2
 * @param  pHPDState pointer to the Hot Plud Detection (HPD) state
 *         This parameter can be take one of the following values:
 *         @arg HPD_STATE_LOW
 *         @arg HPD_STATE_HIGH
 * @retval mux status
 */
MUX_StatusTypeDef BSP_MUX_GetHPDState(MUX_TypeCMuxIdTypeDef  TypeCMuxId,
                                      MUX_HPDStateTypeDef *  pHPDState)
{
    uint32_t ret = 0;

