STMicroelectronics/STM32CubeG0/Drivers/BSP/STM32G0C1E-EV/stm32g0c1e_eval_mux.c
    /* Initialize returned HPDState */
    *pHPDState = HPD_STATE_LOW;

    /* Read HPDState */
    switch (TypeCMuxId)
    {
    case TYPE_C_MUX_2:
        *pHPDState = (MUX_HPDStateTypeDef)MUX_DET_GetState();
        break;

    default:
        ret++;
        break;
    }

    return (ret == 0) ? MUX_OK : MUX_ERROR;
}

/**
 * @brief  Generate an HPD_IRQ towards the DP source device.
 * @note This function must be called every time an HPD_IRQ is detected by the
 *       PD communication stack.
 * @param  TypeCMuxId Type-C MUX identifier
 *         This parameter can be take one of the following values:
 *         @arg TYPE_C_MUX_1
 *         @arg TYPE_C_MUX_2
 * @retval mux status
 */
MUX_StatusTypeDef BSP_MUX_HPDIRQ(MUX_TypeCMuxIdTypeDef  TypeCMuxId)
{
    MUX_StatusTypeDef ret = MUX_ERROR;

    return ret;
}

/**
 * @brief  Display port hot plug detection (HPD)function.
 * @note This function must be called when a display bort capable device
 *       is connected to the Display Port source receptacle of the MB1352
 *       daughter board.
 * @retval none
 */
void BSP_MUX_Detect_HPD(void)
{
  if (Context.pfnHPDCallbackFunc != (MUX_HPDCallbackFuncTypeDef *)NULL)
  {
    HAL_TIM_Base_Start_IT(&htim);
  }
}

/**
 * @brief  HPD callback function registration.
 * @note The sink device drives a hot plug detect (HPD) signal to notify the
 *       source that a sink is present.
 * @note Once registered, HPD callback function will be called upon connection
 *       disconnection of a DP Sink device.
 * @param  TypeCMuxId Type-C MUX identifier
 *         This parameter can be take one of the following values:
 *         @arg TYPE_C_MUX_1
 *         @arg TYPE_C_MUX_2
 * @param  pHPDCallbackFunc HPD callback function pointer
 * @retval mux status
 */
MUX_StatusTypeDef BSP_MUX_RegisterHPDCallbackFunc(MUX_TypeCMuxIdTypeDef        TypeCMuxId,
        MUX_HPDCallbackFuncTypeDef * pHPDCallbackFunc)
{
    uint8_t ret = 0;

    if (TypeCMuxId == TYPE_C_MUX_2)
    {
        Context.pfnHPDCallbackFunc = pHPDCallbackFunc;
    }
    else
    {
        ret++;
    }

    return (ret == 0) ? MUX_OK : MUX_ERROR;
}

/**
  * @brief  Initializes the TIM Base MSP.
  * @param  htim TIM handle
  * @retval None
  */
void HAL_TIM_Base_MspInit(TIM_HandleTypeDef *htim)
{
    /* Enable Debounce Timer clock */
    DEBOUNCE_TIM_CLK_ENABLE();

    /* NVIC configuration for debounce timer interrupt */
    HAL_NVIC_SetPriority(DEBOUNCE_TIM_IRQn, 1, 0);
    HAL_NVIC_EnableIRQ(DEBOUNCE_TIM_IRQn);
}

/**
  * @brief  DeInitialize TIM Base MSP.
  * @param  htim TIM handle
  * @retval None
  */
void HAL_TIM_Base_MspDeInit(TIM_HandleTypeDef *htim)
{
    /* Enable Debounce Timer clock */
    DEBOUNCE_TIM_CLK_DISABLE();

    /* Disable Debounce timer interrupt */
    HAL_NVIC_DisableIRQ(DEBOUNCE_TIM_IRQn);
}

#if defined(TUSB546_DEBUG) || defined(CBTL08GP053_DEBUG) || defined(SN65DP141_DEBUG)
/**
 * @brief  Dump the register content of a device .
 * @param  Device device(s)
 *          This parameter can be any combination of the following values:
 *            DEVICE_CBTL08GP053
 *            DEVICE_SN65DP141
 *            DEVICE_TUSB546
 * @retval none
 */
void BSP_MUX_DumpDeviceRegisters(uint32_t Device)
{
#if defined(CBTL08GP053_DEBUG)
    if ((Device & DEVICE_CBTL08GP053) == DEVICE_CBTL08GP053)
    {
        printf("\n\tCBTL08GP053 registers dump:\n");
        MUX_IO_Read(MUX_2_TYPEC_SWITCH_I2C_ADDRESS, CBTL08GP053_REG_SYS_CTRL, &Context.CBTL08GP053_Registers.SysCtrl.Register);
        printf("\t\tSYS_CTRL   : 0x%0.2x\n", Context.CBTL08GP053_Registers.SysCtrl.Register);
        MUX_IO_Read(MUX_2_TYPEC_SWITCH_I2C_ADDRESS, CBTL08GP053_REG_OP1_CTRL, &Context.CBTL08GP053_Registers.Op1Ctrl.Register);
        printf("\t\tOP1_CTRL   : 0x%0.2x\n", Context.CBTL08GP053_Registers.Op1Ctrl.Register);
        MUX_IO_Read(MUX_2_TYPEC_SWITCH_I2C_ADDRESS, CBTL08GP053_REG_OP2_CTRL, &Context.CBTL08GP053_Registers.Op2Ctrl.Register);
        printf("\t\tOP2_CTRL   : 0x%0.2x\n", Context.CBTL08GP053_Registers.Op2Ctrl.Register);
        MUX_IO_Read(MUX_2_TYPEC_SWITCH_I2C_ADDRESS, CBTL08GP053_REG_OP3_CTRL, &Context.CBTL08GP053_Registers.Op3Ctrl.Register);
        printf("\t\tOP3_CTRL   : 0x%0.2x\n", Context.CBTL08GP053_Registers.Op3Ctrl.Register);
        MUX_IO_Read(MUX_2_TYPEC_SWITCH_I2C_ADDRESS, CBTL08GP053_REG_OP4_CTRL, &Context.CBTL08GP053_Registers.Op4Ctrl.Register);
        printf("\t\tOP4_CTRL   : 0x%0.2x\n", Context.CBTL08GP053_Registers.Op4Ctrl.Register);
        MUX_IO_Read(MUX_2_TYPEC_SWITCH_I2C_ADDRESS, CBTL08GP053_REG_OP5_CTRL, &Context.CBTL08GP053_Registers.Op5Ctrl.Register);
        printf("\t\tOP5_CTRL   : 0x%0.2x\n", Context.CBTL08GP053_Registers.Op5Ctrl.Register);
        MUX_IO_Read(MUX_2_TYPEC_SWITCH_I2C_ADDRESS, CBTL08GP053_REG_CROSS5_CTRL, &Context.CBTL08GP053_Registers.Cross5Ctrl.Register);
        printf("\t\tCROSS5_CTRL: 0x%0.2x\n", Context.CBTL08GP053_Registers.Cross5Ctrl.Register);
        MUX_IO_Read(MUX_2_TYPEC_SWITCH_I2C_ADDRESS, CBTL08GP053_REG_SW_CTRL, &Context.CBTL08GP053_Registers.SwCtrl.Register);
        printf("\t\tSW_CTRL    : 0x%0.2x\n", Context.CBTL08GP053_Registers.SwCtrl.Register);
        MUX_IO_Read(MUX_2_TYPEC_SWITCH_I2C_ADDRESS, CBTL08GP053_REG_REVISION, &Context.CBTL08GP053_Registers.Revision);
        printf("\t\tREVISION   : 0x%0.2x\n", Context.CBTL08GP053_Registers.Revision);
    }
#endif /*  CBTL08GP053_DEBUG */

#if defined(SN65DP141_DEBUG)
    if ((Device & DEVICE_SN65DP141) == DEVICE_SN65DP141)
    {
        printf("\n\tSN65DP141 registers dump:\n");
        MUX_IO_Read(MUX_2_DP_REDRIVER_I2C_ADDRESS, SN65DP141_REG_CFG, &Context.SN65DP141_Registers.General.Register);
        printf("\t\tGeneral Device Settings   : 0x%0.2x\n", Context.SN65DP141_Registers.General.Register);
        MUX_IO_Read(MUX_2_DP_REDRIVER_I2C_ADDRESS, SN65DP141_REG_CHEN, &Context.SN65DP141_Registers.ChannelEnable.Register);
        printf("\t\tChannel Enable            : 0x%0.2x\n", Context.SN65DP141_Registers.ChannelEnable.Register);
        MUX_IO_Read(MUX_2_DP_REDRIVER_I2C_ADDRESS, SN65DP141_REG_CH0_CFG, &Context.SN65DP141_Registers.Channel0Ctrl.Register);
        printf("\t\tChannel 0 Control Settings: 0x%0.2x\n", Context.SN65DP141_Registers.Channel0Ctrl.Register);
        MUX_IO_Read(MUX_2_DP_REDRIVER_I2C_ADDRESS, SN65DP141_REG_CH0_EN, &Context.SN65DP141_Registers.Channel0Enable.Register);
        printf("\t\tChannel 0 Enable Settings : 0x%0.2x\n", Context.SN65DP141_Registers.Channel0Enable.Register);
        MUX_IO_Read(MUX_2_DP_REDRIVER_I2C_ADDRESS, SN65DP141_REG_CH1_CFG, &Context.SN65DP141_Registers.Channel1Ctrl.Register);
        printf("\t\tChannel 1 Control Settings: 0x%0.2x\n", Context.SN65DP141_Registers.Channel1Ctrl.Register);
        MUX_IO_Read(MUX_2_DP_REDRIVER_I2C_ADDRESS, SN65DP141_REG_CH1_EN, &Context.SN65DP141_Registers.Channel1Enable.Register);
        printf("\t\tChannel 1 Enable Settings : 0x%0.2x\n", Context.SN65DP141_Registers.Channel1Enable.Register);
        MUX_IO_Read(MUX_2_DP_REDRIVER_I2C_ADDRESS, SN65DP141_REG_CH2_CFG, &Context.SN65DP141_Registers.Channel2Ctrl.Register);
        printf("\t\tChannel 2 Control Settings: 0x%0.2x\n", Context.SN65DP141_Registers.Channel2Ctrl.Register);
        MUX_IO_Read(MUX_2_DP_REDRIVER_I2C_ADDRESS, SN65DP141_REG_CH2_EN, &Context.SN65DP141_Registers.Channel2Enable.Register);
        printf("\t\tChannel 2 Enable Settings : 0x%0.2x\n", Context.SN65DP141_Registers.Channel2Enable.Register);
        MUX_IO_Read(MUX_2_DP_REDRIVER_I2C_ADDRESS, SN65DP141_REG_CH3_CFG, &Context.SN65DP141_Registers.Channel3Ctrl.Register);
        printf("\t\tChannel 3 Control Settings: 0x%0.2x\n", Context.SN65DP141_Registers.Channel3Ctrl.Register);
        MUX_IO_Read(MUX_2_DP_REDRIVER_I2C_ADDRESS, SN65DP141_REG_CH3_EN, &Context.SN65DP141_Registers.Channel3Enable.Register);
        printf("\t\tChannel 3 Enable Settings : 0x%0.2x\n", Context.SN65DP141_Registers.Channel3Enable.Register);
    }
#endif /* SN65DP141_DEBUG */

#if defined(TUSB546_DEBUG)
    if ((Device & DEVICE_TUSB546) == DEVICE_TUSB546)
    {
        MUX_IO_Read(MUX_1_TYPEC_SWITCH_I2C_ADDRESS, TUSB546_REG_CTRL, &Context.TUSB546_Registers.General.Register);
        MUX_IO_Read(MUX_1_TYPEC_SWITCH_I2C_ADDRESS, TUSB546_REG_DP_CTRL1, &Context.TUSB546_Registers.DPCtrlStatus10.Register);
        MUX_IO_Read(MUX_1_TYPEC_SWITCH_I2C_ADDRESS, TUSB546_REG_DP_CTRL2, &Context.TUSB546_Registers.DPCtrlStatus11.Register);
        MUX_IO_Read(MUX_1_TYPEC_SWITCH_I2C_ADDRESS, TUSB546_REG_DP_CTRL3, &Context.TUSB546_Registers.DPCtrlStatus12.Register);
        MUX_IO_Read(MUX_1_TYPEC_SWITCH_I2C_ADDRESS, TUSB546_REG_DP_CTRL4, &Context.TUSB546_Registers.DPCtrlStatus13.Register);
    }
#endif /* TUSB546_DEBUG */
}
#endif /* TUSB546_DEBUG || CBTL08GP053_DEBUG || SN65DP141_DEBUG */
/**
  * @}
  */


