STMicroelectronics/STM32CubeG0/Drivers/BSP/STM32G0C1E-EV/stm32g0c1e_eval_mux.c
/** @addtogroup STM32G0C1E_EVAL_MUX_Private_Functions
  * @{
  */
/**
* @brief  Configures DET GPIO.
* @note   This function configures Detection GPIO pin for DET_HPD_SOURCE
* @retval None
*/
static void MUX_DET_Init(void)
{
    GPIO_InitTypeDef  GPIO_InitStruct;

    /* Enable the GPIO_DET clock */
    DET_HPD_SOURCE_GPIO_CLK_ENABLE();

    /* Configure the GPIO_MOS pin */
    GPIO_InitStruct.Pin = DET_HPD_SOURCE_PIN;
    GPIO_InitStruct.Mode = GPIO_MODE_IT_RISING_FALLING;
    GPIO_InitStruct.Pull = GPIO_PULLDOWN;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;

    HAL_GPIO_Init(DET_HPD_SOURCE_GPIO_PORT, &GPIO_InitStruct);

    /* Enable and set EXTI lines Interrupt to the lowest priority */
    HAL_NVIC_SetPriority(DET_EXTI_IRQn, 2, 0);
    HAL_NVIC_EnableIRQ(DET_EXTI_IRQn);
}

/**
* @brief  Reset DET GPIO configuration.
* @note   This function resets configuration of Detection GPIO pin for DET_HPD_SOURCE
* @retval None
*/
static void MUX_DET_DeInit(void)
{
    /* Disable EXTI lines Interrupt */
    HAL_NVIC_DisableIRQ(DET_EXTI_IRQn);
    HAL_GPIO_DeInit(DET_HPD_SOURCE_GPIO_PORT, DET_HPD_SOURCE_PIN);
}

/**
* @brief  Returns the selected Detect state.
* @note   This function returns GPIO pin state for DET_HPD_SOURCE
* @retval The Detect GPIO pin value
*/
static MUX_DETState_TypeDef MUX_DET_GetState(void)
{
  GPIO_PinState PinState;

  PinState = HAL_GPIO_ReadPin(DET_HPD_SOURCE_GPIO_PORT, DET_HPD_SOURCE_PIN);
  /* Update Context */
  Context.HPDState = HPD_STATE_LOW;
  if (GPIO_PIN_SET == PinState)
  {
    Context.HPDState = HPD_STATE_HIGH;
  }

  return (PinState == GPIO_PIN_RESET) ? DET_STATE_LOW : DET_STATE_HIGH;
}

/**
* @brief  Configures SEL GPIO.
* @param  Sel Specifies the Select Pin to be configured.
*   This parameter can be one of following parameters:
*     @arg SEL_HPDIN
* @retval None
*/
static void MUX_SEL_Init(SelectId_TypeDef Sel)
{
    GPIO_InitTypeDef  GPIO_InitStruct;

    /* Enable the GPIO_DET clock */
    SELx_GPIO_CLK_ENABLE(Sel);

    /* Configure the GPIO_MOS pin */
    GPIO_InitStruct.Pin = SEL_PIN[Sel];
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull = GPIO_PULLDOWN;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;

    HAL_GPIO_Init(SEL_PORT[Sel], &GPIO_InitStruct);

    HAL_GPIO_WritePin(SEL_PORT[Sel], SEL_PIN[Sel], GPIO_PIN_RESET);
}

/**
* @brief  Reset SEL GPIO configuration.
* @param  Sel Specifies the Select Pin.
*   This parameter can be one of following parameters:
*     @arg SEL_HPDIN
* @retval None
*/
static void MUX_SEL_DeInit(SelectId_TypeDef Sel)
{
    HAL_GPIO_DeInit(SEL_PORT[Sel], SEL_PIN[Sel]);
}

/**
* @brief  Turns selected Sel On.
* @param  Sel Specifies the Select Pin to be configured.
*   This parameter can be one of following parameters:
*     @arg SEL_HPDIN
* @retval None
*/
static void MUX_SEL_On(SelectId_TypeDef Sel)
{
    HAL_GPIO_WritePin(SEL_PORT[Sel], SEL_PIN[Sel], GPIO_PIN_SET);
}

/**
* @brief  Turns selected Det Off.
* @param  Sel Specifies the Select Pin to be configured.
*   This parameter can be one of following parameters:
*     @arg SEL_HPDIN
* @retval None
*/
static void MUX_SEL_Off(SelectId_TypeDef Sel)
{
    HAL_GPIO_WritePin(SEL_PORT[Sel], SEL_PIN[Sel], GPIO_PIN_RESET);
}

/**
* @brief  Set debounce timer configuration.
* @param  DebounceTime Debounce time (in us)
* @retval None
*/
static void MUX_DebounceTimerSetConfig(uint32_t DebounceTime)
{
    __HAL_TIM_RESET_HANDLE_STATE(&htim);

    htim.Init.Prescaler         = (DEBOUNCE_TIM_COUNTER_CLK_FREQ() / 1000000) -1;
    htim.Init.CounterMode       = TIM_COUNTERMODE_UP;
    htim.Init.Period            = DebounceTime - 1;
    htim.Init.ClockDivision     = TIM_CLOCKDIVISION_DIV1;
    htim.Init.RepetitionCounter = 0;
    htim.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;

    HAL_TIM_Base_Init(&htim);
}

/**
* @brief  Reset debounce timer configuration.
* @retval None
*/
static void MUX_DebounceTimerResetConfig(void)
{
    HAL_TIM_Base_DeInit(&htim);
}

/**
  * @brief  Period elapsed callback in non-blocking mode
  * @param  htim TIM handle
  * @retval None
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
    HAL_TIM_Base_Stop_IT(htim);

    if ((Context.HPDState == HPD_STATE_LOW) && (DET_STATE_HIGH == MUX_DET_GetState()))
    {
        /* Invoke registered callback function */
        Context.pfnHPDCallbackFunc(TYPE_C_MUX_2, HPD_STATE_HIGH);
    }

    if ((Context.HPDState == HPD_STATE_HIGH) && (DET_STATE_LOW == MUX_DET_GetState()))
    {
        /* Invoke registered callback function */
        Context.pfnHPDCallbackFunc(TYPE_C_MUX_2, HPD_STATE_LOW);
    }
}
/**
  * @}
  */


/**
  * @}
  */


/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
